Unix/tests/protocol/posthttp/test2.request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"><s:Header><a:To>https://157.59.85.220:7779/wsman</a:To><w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wscim/1/cim-schema/2/OMI_Datetime</w:ResourceURI><a:ReplyTo><a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address></a:ReplyTo><a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action><w:MaxEnvelopeSize s:mustUnderstand="true">32768</w:MaxEnvelopeSize><a:MessageID>uuid:498D1C73-D311-425A-8F2E-14D19629467F</a:MessageID><w:Locale xml:lang="en-US" s:mustUnderstand="false" /><p:DataLocale xml:lang="en-US" s:mustUnderstand="false" /><w:SelectorSet><w:Selector Name="__cimnamespace">root/cimv2</w:Selector></w:SelectorSet><w:OperationTimeout>PT60.000S</w:OperationTimeout></s:Header><s:Body><n:Enumerate><w:OptimizeEnumeration/><w:MaxElements>5000</w:MaxElements></n:Enumerate></s:Body></s:Envelope>
